/*
MySQL Data Transfer
Source Host: 192.168.111.141
Source Database: hxtd
Target Host: 192.168.111.141
Target Database: hxtd
Date: 2014/7/8 14:23:55
*/

SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for sm_user
-- ----------------------------
CREATE TABLE `sm_user` (
  `ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `LOGIN_NAME` varchar(32) NOT NULL DEFAULT '' COMMENT '登录名',
  `PASSWORD` varchar(64) NOT NULL DEFAULT '' COMMENT '密码',
  `CODE` varchar(32) DEFAULT '',
  `USER_NAME` varchar(32) NOT NULL DEFAULT '' COMMENT '用户名',
  `ORDER` int(11) DEFAULT NULL,
  `IS_ACTIVE` char(1) NOT NULL DEFAULT '1' COMMENT '是否启用 1启用 0禁用',
  `JOB_SITUATION` int(11) DEFAULT NULL,
  `SEX_ID` int(11) DEFAULT NULL,
  `PHONE` varchar(32) NOT NULL DEFAULT '' COMMENT '电话号码',
  `MOBILE` varchar(32) NOT NULL DEFAULT '' COMMENT '手机号码',
  `EMAIL` varchar(32) NOT NULL DEFAULT '' COMMENT '邮箱',
  `QQ` varchar(16) NOT NULL DEFAULT '',
  `IS_MANAGER` int(11) NOT NULL,
  `JOB_NAME` varchar(64) NOT NULL DEFAULT '' COMMENT '职位',
  `REMARK` varchar(512) NOT NULL DEFAULT '' COMMENT '备注',
  `CREATOR_ID` int(11) NOT NULL DEFAULT '0' COMMENT '创建者ID',
  `CREATED_TIME` datetime NOT NULL COMMENT '创建时间',
  `MODIFIER_ID` int(11) DEFAULT NULL,
  `MODIFIED_TIME` timestamp NULL DEFAULT NULL,
  `STORE_STATUS` int(11) DEFAULT NULL COMMENT '数据存储状态：1.最新的；2.延迟的',
  `ORGANIZATION_ID` int(11) NOT NULL,
  `IS_DELETED` int(11) DEFAULT NULL,
  `IS_INITIALIZED` tinyint(1) NOT NULL DEFAULT '1',
  PRIMARY KEY (`ID`),
  UNIQUE KEY `INDEX_LOGIN_NAME` (`LOGIN_NAME`),
  KEY `INDEX_NO` (`CODE`),
  KEY `INDEX_CREATOR_ID` (`CREATOR_ID`),
  KEY `INDEX_MODIFIER_ID` (`MODIFIER_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=26666 DEFAULT CHARSET=utf8 COMMENT='用户表';

-- ----------------------------
-- Records 
-- ----------------------------
INSERT INTO `sm_user` VALUES ('1', 'admin', 'e10adc3949ba59abbe56e057f20f883e', '', '管理员', '1', '1', '1040301', '11010215', '18620088324', '0000000000', '00000000@gmail.com', '000000000', '1', '工程师', '', '1', '2014-05-26 00:00:00', '1', '2014-05-26 19:29:03', '1040401', '1', '0', '1');
INSERT INTO `sm_user` VALUES ('2', 'majingliang', 'e10adc3949ba59abbe56e057f20f883e', '', '马敬亮', '2', '1', '1040301', '11010215', '18620088324', '0000000000', '00000000@gmail.com', '000000000', '0', '工程师', '', '1', '2014-05-26 00:00:00', '1', '2014-05-26 19:29:03', '1040402', '101', '0', '1');
INSERT INTO `sm_user` VALUES ('3', 'lihua', 'e10adc3949ba59abbe56e057f20f883e', '', '李华', '3', '1', '1040301', '11010215', '18620088324', '0000000000', '00000000@gmail.com', '000000000', '0', '工程师', '', '1', '2014-05-26 00:00:00', '1', '2014-05-26 00:00:00', '1040402', '103', '0', '1');
INSERT INTO `sm_user` VALUES ('4', 'luanruisong', 'e10adc3949ba59abbe56e057f20f883e', '', '栾瑞松', '4', '1', '1040301', '11010215', '18620088324', '0000000000', '00000000@gmail.com', '000000000', '0', '工程师', '', '1', '2014-05-26 00:00:00', '1', '2014-05-26 00:00:00', '1040402', '10301', '0', '1');
INSERT INTO `sm_user` VALUES ('26643', 'test', 'e10adc3949ba59abbe56e057f20f883e', '', '测试', '1', '1', '1040301', '11010215', '', '', '', '', '0', '', '', '1', '2014-06-24 17:06:54', '1', '2014-07-02 11:11:26', '1040402', '1', '1', '0');
INSERT INTO `sm_user` VALUES ('26644', 'huizijing', 'e10adc3949ba59abbe56e057f20f883e', '', 'huizi', '1', '1', '1040301', '11010216', '', '', '', '', '1', '', '', '1', '2014-06-26 13:54:22', '1', '2014-06-26 13:54:22', '1040402', '10301', '0', '1');
INSERT INTO `sm_user` VALUES ('26645', 'huali', 'e10adc3949ba59abbe56e057f20f883e', '', '李华', '1', '1', '1040301', '11010215', '', '', '', '', '0', '', '', '1', '2014-06-27 17:30:39', '1', '2014-06-27 17:30:39', '1040402', '101', '0', '1');
INSERT INTO `sm_user` VALUES ('26648', 'test1', 'c4ca4238a0b923820dcc509a6f75849b', '', '1', '1', '1', '1040301', '11010215', '', '', '', '', '0', '', '', '1', '2014-06-27 08:55:14', '1', '2014-07-02 11:48:45', '1040402', '102', '1', '0');
INSERT INTO `sm_user` VALUES ('26649', 'ceshi1', 'e10adc3949ba59abbe56e057f20f883e', '', '测试A', '1', '1', '1040301', '11010215', '18620623071', '18620623071', '', '976973857', '0', 'XXX', '', '1', '2014-06-27 11:26:04', '1', '2014-07-02 11:11:39', '1040402', '102', '1', '0');
INSERT INTO `sm_user` VALUES ('26650', 'ceshi2', 'e10adc3949ba59abbe56e057f20f883e', '', '测试2', '1', '1', '1040301', '11010215', '', '', '', '', '0', '', 'sfsf', '1', '2014-06-27 11:26:36', '1', '2014-07-07 09:14:25', '1040402', '101', '1', '0');
INSERT INTO `sm_user` VALUES ('26651', 'ceshi3', 'e10adc3949ba59abbe56e057f20f883e', '', '测试3', '1', '1', '1040301', '11010215', '', '', '', '', '0', '', '', '1', '2014-06-27 11:26:59', '1', '2014-07-02 11:11:39', '1040402', '102', '1', '0');
INSERT INTO `sm_user` VALUES ('26653', '123', '202cb962ac59075b964b07152d234b70', '', '123', '1', '1', '1040301', '11010215', '13636409512', '13636409512', '13636409512@qq.com', '236598785', '1', '13636409512', '13636409512', '1', '2014-07-02 10:56:37', '1', '2014-07-02 11:38:59', '1040402', '102', '1', '0');
INSERT INTO `sm_user` VALUES ('26655', 'vvvv', '4786f3282f04de5b5c7317c490c6d922', '', 'vvvv', '1', '1', '1040301', '11010215', '13636409512', '13636409512', '13636409512@qq.com', '13636425', '0', '', '', '1', '2014-07-02 11:16:07', '1', '2014-07-02 11:45:46', '1040402', '10321', '1', '0');
INSERT INTO `sm_user` VALUES ('26656', 'cccc', '41fcba09f2bdcdf315ba4119dc7978dd', '', 'ccccc', '1', '1', '1040301', '11010215', '13636409578', '13636409578', '13636409578@qq.com', '13636409', '0', '13636409578', '', '1', '2014-07-02 11:45:10', '1', '2014-07-02 11:45:46', '1040402', '102', '1', '0');
INSERT INTO `sm_user` VALUES ('26657', 'nnnn', 'ae135ba6ad9f5b531e9c3a379bedfc67', '', 'nnnnn', '1', '1', '1040301', '11010215', '13636409578', '13636409578', '13636409578@qq.com', '13636409', '0', '', '13636409578', '1', '2014-07-02 11:46:48', '1', '2014-07-02 11:46:48', '1040402', '101', '0', '0');
INSERT INTO `sm_user` VALUES ('26658', 'xxxx', 'ea416ed0759d46a8de58f63a59077499', '', 'xxxx', '1', '1', '1040301', '11010215', '13636895789', '13636895789', '13636895789@qq.com', '13636895', '0', '', '', '1', '2014-07-02 11:49:26', '1', '2014-07-02 11:50:08', '1040402', '102', '0', '0');
INSERT INTO `sm_user` VALUES ('26659', 'huizijing2', 'e10adc3949ba59abbe56e057f20f883e', '', '惠子静', '1', '1', '1040301', '11010216', '', '', '', '', '1', '', '', '1', '2014-07-03 16:29:59', '1', '2014-07-08 13:42:34', '1040402', '1', '0', '0');
INSERT INTO `sm_user` VALUES ('26660', 'huizijing3', 'e10adc3949ba59abbe56e057f20f883e', '', 'huizijng', '1', '1', '1040301', '11010216', '', '', '', '', '1', '', '', '1', '2014-07-03 16:30:32', '1', '2014-07-08 09:58:35', '1040402', '1', '1', '0');
INSERT INTO `sm_user` VALUES ('26662', '测试x', 'e10adc3949ba59abbe56e057f20f883e', '', '测试x', '1', '1', '1040301', '11010215', '', '', '', '', '0', '', '', '1', '2014-07-04 10:39:41', '1', '2014-07-04 10:39:41', '1040402', '10301', '0', '0');
INSERT INTO `sm_user` VALUES ('26663', 'admin5', 'e10adc3949ba59abbe56e057f20f883e', '', 'tom', '1', '1', '1040301', '11010215', '', '', '', '', '1', '', '', '1', '2014-07-07 20:55:02', '1', '2014-07-08 09:26:41', '278786', '10321', '0', '0');
INSERT INTO `sm_user` VALUES ('26664', '2331', 'e10adc3949ba59abbe56e057f20f883e', '', '3213', '1', '1', '1040301', '11010215', '', '', '', '', '0', '', '', '1', '2014-07-08 13:09:21', '1', '2014-07-08 13:09:21', '278786', '102', '0', '0');
INSERT INTO `sm_user` VALUES ('26665', '哈哈哈哈', 'e10adc3949ba59abbe56e057f20f883e', '', '234324', '1', '1', '1040301', '11010215', '', '', '', '', '0', '', '', '1', '2014-07-08 13:34:06', '1', '2014-07-08 13:38:08', '278786', '10321', '1', '0');
